{
  "Référentiel de sécurité": {
    "name": "ISO 27002",
    "Exigence": [
      {
        "id": "5.1.1",
        "Titre": "Politiques de sécurité de l’information",
        "Description": "Il convient de définir un ensemble de politiques en matière de sécurité de l’information qui soit approuvé par la direction, diffusé et communiqué aux salariés et aux tiers concernés."
      },
      {
        "id": "5.1.2",
        "Titre": "Revue des politiques de sécurité de l’information",
        "Description": "Pour garantir la constance de la pertinence, de l’adéquation et de l’efficacité des politiques liées à la sécurité de l’information, il convient de revoir ces politiques à intervalles programmés ou en cas de changements majeurs."
      },
      {
        "id": "6.1.1",
        "Titre": "Fonctions et responsabilités liées à la sécurité de l’information",
        "Description": "Il convient de définir et d’attribuer toutes les responsabilités en matière de sécurité de l’information."
      },
      {
        "id": "6.1.2",
        "Titre": "Séparation des tâches",
        "Description": "Il convient de séparer les tâches et les domaines de responsabilité incompatibles pour limiter les possibilités de modification ou de mauvais usage, non autorisé(e) ou involontaire, des actifs de l’organisation."
      },
      {
        "id": "6.1.3",
        "Titre": "Relations avec les autorités",
        "Description": "Il convient d’entretenir des relations appropriées avec les autorités compétentes."
      },
      {
        "id": "6.1.4",
        "Titre": "Relations avec des groupes de travail spécialisés",
        "Description": "Il convient d’entretenir des relations appropriées avec des groupes d’intérêt, des forums spécialisés dans la sécurité et des associations professionnelles."
      },
      {
        "id": "6.1.5",
        "Titre": "La sécurité de l’information dans la gestion de projet",
        "Description": "Il convient de traiter la sécurité de l’information dans la gestion de projet, quel que soit le type de projet concerné."
      },
      {
        "id": "6.2.1",
        "Titre": "Politique en matière d’appareils mobiles",
        "Description": "Il convient d’adopter une politique et des mesures de sécurité complémentaires pour gérer les risques découlant de l’utilisation des appareils mobiles."
      },
      {
        "id": "6.2.2",
        "Titre": "Télétravail",
        "Description": "Il convient de mettre en oeuvre une politique et des mesures de sécurité complémentaires pour protéger les informations consultées, traitées ou stockées sur des sites de télétravail."
      },
      {
        "id": "7.1.1",
        "Titre": "Sélection des candidats",
        "Description": "Il convient que des vérifications des informations concernant tous les candidats à l’embauche soient réalisées conformément aux lois, aux règlements et à l’éthique, et il convient qu’elles soient proportionnelles aux exigences métier, à la classification des informations accessibles et aux risques identifiés."
      },
      {
        "id": "7.1.2",
        "Titre": "Termes et conditions d’embauche",
        "Description": "Il convient que les accords contractuels conclus avec les salariés et les contractants déterminent leurs responsabilités et celles de l’organisation en matière de sécurité de l’information."
      },
      {
        "id": "7.2.1",
        "Titre": "Responsabilités de la direction",
        "Description": "Il convient que la direction demande à tous les salariés et contractants d’appliquer les règles de sécurité conformément aux politiques et aux procédures en vigueur dans l’organisation."
      },
      {
        "id": "7.2.2",
        "Titre": "Sensibilisation, apprentissage et formation à la sécurité de l’information",
        "Description": "Il convient que l’ensemble des salariés de l’organisation et, le cas échéant, les contractants suivent un apprentissage et des formations de sensibilisation adaptés et qu’ils reçoivent régulièrement les mises à jour des politiques et procédures de l’organisation s’appliquant à leurs fonctions."
      },
      {
        "id": "7.2.3",
        "Titre": "Processus disciplinaire",
        "Description": "Il convient qu’il existe un processus disciplinaire formel et connu de tous pour prendre des mesures à l’encontre des salariés ayant enfreint les règles liées à la sécurité de l’information."
      },
      {
        "id": "7.3.1",
        "Titre": "Achèvement ou modification des responsabilités associées au contrat de travail",
        "Description": "Il convient de définir les responsabilités et les missions liées à la sécurité de l’information qui restent valables à l’issue de la rupture, du terme ou de la modification du contrat de travail, d’en informer le salarié ou le contractant et de veiller à leur application."
      },
      {
        "id": "8.1.1",
        "Titre": "Inventaire des actifs",
        "Description": "Il convient d’identifier les actifs associés à l’information et aux moyens de traitement de l’information et de dresser et tenir à jour un inventaire de ces actifs."
      },
      {
        "id": "8.1.2",
        "Titre": "Propriété des actifs",
        "Description": "Il convient que les actifs figurant à l’inventaire aient un propriétaire."
      },
      {
        "id": "8.1.3",
        "Titre": "Utilisation correcte des actifs",
        "Description": "Il convient d’identifier, de documenter et de mettre en oeuvre des règles d’utilisation correcte de l’information, des actifs associés à l’information et des moyens de traitement de l’information."
      },
      {
        "id": "8.1.4",
        "Titre": "Restitution des actifs",
        "Description": "Il convient que tous les salariés et utilisateurs tiers restituent la totalité des actifs de l’organisation qu’ils ont en leur possession au terme de la période d’emploi, du contrat ou de l’accord."
      },
      {
        "id": "8.2.1",
        "Titre": "Classification des informations",
        "Description": "Il convient de classer les informations en termes de valeur, d’exigences légales, de sensibilité ou de leur caractère critique pour l’entreprise."
      },
      {
        "id": "8.2.2",
        "Titre": "Marquage des informations",
        "Description": "Il convient d’élaborer et de mettre en oeuvre un ensemble approprié de procédures pour le marquage de l’information, conformément au plan de classification de l’information adopté par l’organisation."
      },
      {
        "id": "8.2.3",
        "Titre": "Manipulation des actifsManipulation des actifs",
        "Description": "Il convient d’élaborer et de mettre en oeuvre des procédures de traitement des actifs, conformément au plan de classification de l’information adopté par l’organisation."
      },
      {
        "id": "8.3.1",
        "Titre": "Gestion des supports amovibles",
        "Description": "Il convient de mettre en oeuvre des procédures de gestion des supports amovibles conformément au plan de classification adopté par l’organisation."
      },
      {
        "id": "8.3.2",
        "Titre": "Mise au rebut des supports",
        "Description": "Il convient de procéder à une mise au rebut sécurisée des supports qui ne servent plus, en suivant des procédures formelles."
      },
      {
        "id": "8.3.3",
        "Titre": "Transfert physique des supports",
        "Description": "Il convient de protéger les supports contenant de l’information contre les accès non autorisés, l’utilisation frauduleuse ou l’altération lors du transport."
      },
      {
        "id": "9.1.1",
        "Titre": "Politique de contrôle d’accès",
        "Description": "Il convient d’établir, de documenter et de revoir une politique du contrôle d’accès sur la base des exigences métier et de sécurité de l’information."
      },
      {
        "id": "9.1.2",
        "Titre": "Accès aux réseaux et aux services en réseau",
        "Description": "Il convient que les utilisateurs aient uniquement accès au réseau et aux services en réseau pour lesquels ils ont spécifiquement reçu une autorisation."
      },
      {
        "id": "9.2.1",
        "Titre": "Enregistrement et désinscription des utilisateurs",
        "Description": "Il convient de mettre en oeuvre une procédure formelle d’enregistrement et de désinscription des utilisateurs destinée à permettre l’attribution de droits d’accès."
      },
      {
        "id": "9.2.2",
        "Titre": "Maîtrise de la gestion des accès utilisateur",
        "Description": "Il convient de mettre en oeuvre un processus formel de maîtrise de la gestion des accès utilisateur pour attribuer ou révoquer des droits d’accès à tous les types d’utilisateurs de tous les systèmes et de tous les services d’information."
      },
      {
        "id": "9.2.3",
        "Titre": "Gestion des privilèges d’accès",
        "Description": "Il convient de restreindre et de contrôler l’attribution et l’utilisation des privilèges d’accès."
      },
      {
        "id": "9.2.4",
        "Titre": "Gestion des informations secrètes d’authentification des utilisateurs",
        "Description": "Il convient que l’attribution des informations secrètes d’authentification soit réalisée dans le cadre d’un processus de gestion formel."
      },
      {
        "id": "9.2.5",
        "Titre": "Revue des droits d’accès utilisateur",
        "Description": "Il convient que les propriétaires d’actifs revoient les droits d’accès des utilisateurs à intervalles réguliers."
      },
      {
        "id": "9.2.6",
        "Titre": "Suppression ou adaptation des droits d’accès",
        "Description": "Il convient que les droits d’accès de l’ensemble des salariés et utilisateurs tiers à l’information et aux moyens de traitement de l’information soient supprimés à la fin de leur période d’emploi, ou adaptés en cas de modification du contrat ou de l’accord."
      },
      {
        "id": "9.3.1",
        "Titre": "Utilisation d’informations secrètes d’authentification",
        "Description": "Il convient d’exiger des utilisateurs des informations secrètes d’authentification qu’ils appliquent les pratiques de l’organisation en la matière."
      },
      {
        "id": "9.4.1",
        "Titre": "Restriction d’accès à l’information",
        "Description": "Il convient de restreindre l’accès à l’information et aux fonctions d’application système conformément à la politique de contrôle d’accès."
      },
      {
        "id": "9.4.2",
        "Titre": "Sécuriser les procédures de connexion",
        "Description": "Lorsque la politique de contrôle d’accès l’exige, il convient que l’accès aux systèmes et aux applications soit contrôlé par une procédure de connexion sécurisée."
      },
      {
        "id": "9.4.3",
        "Titre": "Système de gestion des mots de passe",
        "Description": "Il convient que les systèmes qui gèrent les mots de passe soient interactifs et fournissent des mots de passe de qualité."
      },
      {
        "id": "9.4.4",
        "Titre": "Utilisation de programmes utilitaires à privilèges",
        "Description": "Il convient de limiter et de contrôler étroitement l’utilisation des programmes utilitaires permettant de contourner les mesures de sécurité d’un système ou d’une application."
      },
      {
        "id": "9.4.5",
        "Titre": "Contrôle d’accès au code source des programmes",
        "Description": "Il convient de restreindre l’accès au code source des programmes."
      },
      {
        "id": "10.1.1",
        "Titre": "Politique d’utilisation des mesures cryptographiques",
        "Description": "Il convient d’élaborer et de mettre en oeuvre une politique d’utilisation de mesures cryptographiques en vue de protéger l’information."
      },
      {
        "id": "10.1.2",
        "Titre": "Gestion des clés",
        "Description": "Il convient d’élaborer et de mettre en oeuvre tout au long de leur cycle de vie une politique sur l’utilisation, la protection et la durée de vie des clés cryptographiques."
      },
      {
        "id": "11.1.1",
        "Titre": "Périmètre de sécurité physique",
        "Description": "Il convient de définir des périmètres de sécurité servant à protéger les zones contenant l’information sensible ou critique et les moyens de traitement de l’information."
      },
      {
        "id": "11.1.2",
        "Titre": "Contrôles physiques des accès",
        "Description": "Il convient de protéger les zones sécurisées par des contrôles adéquats à l’entrée pour s’assurer que seul le personnel autorisé est admis."
      },
      {
        "id": "11.1.3",
        "Titre": "Sécurisation des bureaux, des salles et des équipements",
        "Description": "Il convient de concevoir et d’appliquer des mesures de sécurité physique aux bureaux, aux salles et aux équipements."
      },
      {
        "id": "11.1.4",
        "Titre": "Protection contre les menaces extérieures et environnementales",
        "Description": "Il convient de concevoir et d’appliquer des mesures de protection physique contre les désastres naturels, les attaques malveillantes ou les accidents."
      },
      {
        "id": "11.1.5",
        "Titre": "Travail dans les zones sécurisées",
        "Description": "Il convient de concevoir et d’appliquer des procédures pour le travail en zone sécurisée."
      },
      {
        "id": "11.1.6",
        "Titre": "Zones de livraison et de chargement",
        "Description": "Il convient de contrôler les points d’accès tels que les zones de livraison et de chargement et les autres points par lesquels des personnes non autorisées peuvent pénétrer dans les locaux et, si possible, de les isoler des moyens de traitement de l’information, de façon à éviter les accès non autorisés."
      },
      {
        "id": "11.2.1",
        "Titre": "Emplacement et protection du matériel",
        "Description": "Il convient de déterminer l’emplacement du matériel et de le protéger de manière à réduire les risques liés à des menaces et dangers environnementaux et les possibilités d’accès non autorisé."
      },
      {
        "id": "11.2.2",
        "Titre": "Services généraux",
        "Description": "Il convient de protéger le matériel des coupures de courant et autres perturbations dues à une défaillance des services généraux."
      },
      {
        "id": "11.2.3",
        "Titre": "Sécurité du câblage",
        "Description": "Il convient de protéger les câbles électriques ou de télécommunication transportant des données ou supportant les services d’information contre toute interception, interférence ou dommage."
      },
      {
        "id": "11.2.4",
        "Titre": "Maintenance du matériel",
        "Description": "Il convient d’entretenir le matériel correctement pour garantir sa disponibilité permanente et son intégrité."
      },
      {
        "id": "11.2.5",
        "Titre": "Sortie des actifs",
        "Description": "Il convient de ne pas sortir un matériel, des informations ou des logiciels des locaux de l’organisation sans autorisation préalable."
      },
      {
        "id": "11.2.6",
        "Titre": "Sécurité du matériel et des actifs hors des locaux",
        "Description": "Il convient d’appliquer des mesures de sécurité au matériel utilisé hors des locaux de l’organisation en tenant compte des différents risques associés au travail hors site."
      },
      {
        "id": "11.2.7",
        "Titre": "Mise au rebut ou recyclage sécurisé(e) du matériel",
        "Description": "Il convient de vérifier chacun des éléments du matériel contenant des supports de stockage pour s’assurer que toute donnée sensible a bien été supprimée et que tout logiciel sous licence a bien été désinstallé ou écrasé de façon sécurisée, avant sa mise au rebut ou sa réutilisation."
      },
      {
        "id": "11.2.8",
        "Titre": "Matériel utilisateur laissé sans surveillance",
        "Description": "Il convient que les utilisateurs s’assurent que le matériel non surveillé est doté d’une protection appropriée."
      },
      {
        "id": "11.2.9",
        "Titre": "Politique du bureau propre et de l’écran vide",
        "Description": "Il convient d’adopter une politique du bureau propre pour les documents papier et les supports de stockage amovibles, et une politique de l’écran vide pour les moyens de traitement de l’information."
      },
      {
        "id": "12.1.1",
        "Titre": "Procédures d’exploitation documentées",
        "Description": "Il convient de documenter les procédures d’exploitation et de les mettre à disposition de tous les utilisateurs concernés."
      },
      {
        "id": "12.1.2",
        "Titre": "Gestion des changements",
        "Description": "Il convient de contrôler les changements apportés à l’organisation, aux processus métier, aux systèmes et moyens de traitement de l’information qui influent sur la sécurité de l’information."
      },
      {
        "id": "12.1.3",
        "Titre": "Dimensionnement",
        "Description": "Il convient de surveiller et d’ajuster au plus près l’utilisation des ressources et il convient de faire des projections sur les dimensionnements futurs pour garantir les performances exigées du système."
      },
      {
        "id": "12.1.4",
        "Titre": "Séparation des environnements de développement, de test et d’exploitation",
        "Description": "Il convient de séparer les environnements de développement, de test et d’exploitation pour réduire les risques d’accès ou de changements non autorisés dans l’environnement en exploitation."
      },
      {
        "id": "12.2.1",
        "Titre": "Mesures contre les logiciels malveillants",
        "Description": "Il convient de mettre en oeuvre des mesures de détection, de prévention et de récupération, conjuguées à une sensibilisation des utilisateurs adaptée, pour se protéger contre les logiciels malveillants."
      },
      {
        "id": "12.3.1",
        "Titre": "Sauvegarde des informations",
        "Description": "Il convient de réaliser des copies de sauvegarde de l’information, des logiciels et des images systèmes, et de les tester régulièrement conformément à une politique de sauvegarde convenue."
      },
      {
        "id": "12.4.1",
        "Titre": "Journalisation des événements",
        "Description": "Il convient de créer, de tenir à jour et de revoir régulièrement les journaux d’événements enregistrant les activités de l’utilisateur, les exceptions, les défaillances et les événements liés à la sécurité de l’information."
      },
      {
        "id": "12.4.2",
        "Titre": "Protection de l’information journalisée",
        "Description": "Il convient de protéger les moyens de journalisation et l’information journalisée contre les risques de falsification ou d’accès non autorisé."
      },
      {
        "id": "12.4.3",
        "Titre": "Journaux administrateur et opérateur",
        "Description": "Il convient de journaliser les activités de l’administrateur système et de l’opérateur système, ainsi que de protéger et de revoir régulièrement les journaux."
      },
      {
        "id": "12.4.4",
        "Titre": "Synchronisation des horloges",
        "Description": "Il convient de synchroniser les horloges de l’ensemble des systèmes de traitement de l’information concernés d’une organisation ou d’un domaine de sécurité sur une source de référence temporelle unique."
      },
      {
        "id": "12.5.1",
        "Titre": "Installation de logiciels sur des systèmes en exploitation",
        "Description": "Il convient de mettre en oeuvre des procédures pour contrôler l’installation de logiciels sur des systèmes en exploitation."
      },
      {
        "id": "12.6.1",
        "Titre": "Gestion des vulnérabilités techniques",
        "Description": "Il convient d’être informé en temps voulu des vulnérabilités techniques des systèmes d’information en exploitation, d’évaluer l’exposition de l’organisation à ces vulnérabilités et de prendre les mesures appropriées pour traiter le risque associé."
      },
      {
        "id": "12.6.2",
        "Titre": "Restrictions liées à l’installation de logiciels",
        "Description": "Il convient d’établir et de mettre en oeuvre des règles régissant l’installation de logiciels par les utilisateurs."
      },
      {
        "id": "12.7.1",
        "Titre": "Mesures relatives à l’audit des systèmes d’information",
        "Description": "Pour réduire au minimum les perturbations subies par les processus métier, il convient de planifier avec soin et d’arrêter avec les personnes intéressées les exigences d’audit et les activités impliquant des contrôles des systèmes en exploitation."
      },
      {
        "id": "13.1.1",
        "Titre": "Contrôle des réseaux",
        "Description": "Il convient de gérer et de contrôler les réseaux pour protéger l’information contenue dans les systèmes et les applications."
      },
      {
        "id": "13.1.2",
        "Titre": "Sécurité des services de réseau",
        "Description": "Pour tous les services de réseau, il convient d’identifier les mécanismes de sécurité, les niveaux de service et les exigences de gestion, et de les intégrer dans les accords de services de réseau, que ces services soient fournis en interne ou externalisés."
      },
      {
        "id": "13.1.3",
        "Titre": "Cloisonnement des réseaux",
        "Description": "Il convient que les groupes de services d’information, d’utilisateurs et de systèmes d’information soient cloisonnés sur les réseaux."
      },
      {
        "id": "13.2.1",
        "Titre": "Politiques et procédures de transfert de l’information",
        "Description": "Il convient de mettre en place des politiques, des procédures et des mesures de transfert formelles pour protéger les transferts d’information transitant par tous types d’équipements de communication."
      },
      {
        "id": "13.2.2",
        "Titre": "Accords en matière de transfert d’information",
        "Description": "Il convient que les accords traitent du transfert sécurisé de l’information liée à l’activité entre l’organisation et les tiers."
      },
      {
        "id": "13.2.3",
        "Titre": "Messagerie électronique",
        "Description": "Il convient de protéger de manière appropriée l’information transitant par la messagerie électronique."
      },
      {
        "id": "13.2.4",
        "Titre": "Engagements de confidentialité ou de non-divulgation",
        "Description": "Il convient d’identifier, de revoir régulièrement et de documenter les exigences en matière d’engagements de confidentialité ou de non-divulgation, conformément aux besoins de l’organisation en matière de protection de l’information."
      },
      {
        "id": "14.1.1",
        "Titre": "Analyse et spécification des exigences de sécurité de l’information",
        "Description": "Il convient que les exigences liées à la sécurité de l’information figurent dans les exigences des nouveaux systèmes d’information ou des changements apportés aux systèmes existants."
      },
      {
        "id": "14.1.2",
        "Titre": "Sécurisation des services d’application sur les réseaux publics",
        "Description": "Il convient de protéger l’information liée aux services d’application transmise sur les réseaux publics contre les activités frauduleuses, les différends contractuels, ainsi que la divulgation et la modification non autorisées."
      },
      {
        "id": "14.1.3",
        "Titre": "Protection des transactions liées aux services d’application",
        "Description": "Il convient de protéger l’information impliquée dans les transactions liées aux services d’application pour empêcher une transmission incomplète, des erreurs d’acheminement, la modification non autorisée, la divulgation non autorisée, la duplication non autorisée du message ou sa réémission."
      },
      {
        "id": "14.2.1",
        "Titre": "Politique de développement sécurisé",
        "Description": "Il convient d’établir des règles de développement des logiciels et des systèmes, et de les appliquer aux développements de l’organisation."
      },
      {
        "id": "14.2.2",
        "Titre": "Procédures de contrôle des changements apportés au système",
        "Description": "Il convient de contrôler les changements apportés au système dans le cycle de développement en utilisant des procédures formelles de contrôle des changements."
      },
      {
        "id": "14.2.3",
        "Titre": "Revue technique des applications après changement apporté à la plateforme d’exploitation",
        "Description": "Lorsque des changements sont apportés aux plateformes d’exploitation, il convient de revoir et de tester les applications critiques métier afin de vérifier l’absence de tout effet indésirable sur l’activité ou sur la sécurité."
      },
      {
        "id": "14.2.4",
        "Titre": "Restrictions relatives aux changements apportés aux progiciels",
        "Description": "Il convient de ne pas encourager la modification des progiciels et de se limiter aux changements nécessaires. Il convient également d’exercer un contrôle strict sur ces changements."
      },
      {
        "id": "14.2.5",
        "Titre": "Principes d’ingénierie de la sécurité des systèmes",
        "Description": "Il convient d’établir, de documenter, de tenir à jour et d’appliquer des principes d’ingénierie de la sécurité des systèmes à tous les travaux de mise en oeuvre de systèmes d’information."
      },
      {
        "id": "14.2.6",
        "Titre": "Environnement de développement sécurisé",
        "Description": "Il convient que les organisations établissent un environnement de développement sécurisé pour les tâches de développement et d’intégration du système, qui englobe l’intégralité du cycle de développement du système, et qu’ils en assurent la protection de manière appropriée."
      },
      {
        "id": "14.2.7",
        "Titre": "Développement externalisé",
        "Description": "Il convient que l’organisation supervise et contrôle l’activité de développement du système externalisé."
      },
      {
        "id": "14.2.8",
        "Titre": "Phase de test de la sécurité du système",
        "Description": "Il convient de réaliser les tests de fonctionnalité de la sécurité pendant le développement."
      },
      {
        "id": "14.2.9",
        "Titre": "Test de conformité du système",
        "Description": "Il convient de déterminer des programmes de test de conformité et des critères associés pour les nouveaux systèmes d’information, les mises à jour et les nouvelles versions."
      },
      {
        "id": "14.3.1",
        "Titre": "Protection des données de test",
        "Description": "Il convient que les données de test soient sélectionnées avec soin, protégées et contrôlées."
      },
      {
        "id": "15.1.1",
        "Titre": "Politique de sécurité de l’information dans les relations avec les fournisseurs",
        "Description": "Il convient de convenir avec le fournisseur les exigences de sécurité de l’information pour limiter les risques résultant de l’accès du fournisseur aux actifs de l’organisation et de les documenter."
      },
      {
        "id": "15.1.2",
        "Titre": "La sécurité dans les accords conclus avec les fournisseurs",
        "Description": "Il convient que les exigences applicables liées à la sécurité de l’information soient établies et convenues avec chaque fournisseur pouvant avoir accès, traiter, stocker, communiquer ou fournir des composants de l’infrastructure informatique destinés à l’information de l’organisation."
      },
      {
        "id": "15.1.3",
        "Titre": "Chaine d’approvisionnement informatique",
        "Description": "Il convient que les accords conclus avec les fournisseurs incluent des exigences sur le traitement des risques de sécurité de l’information associés à la chaîne d’approvisionnement des produits et des services informatiques."
      },
      {
        "id": "15.2.1",
        "Titre": "Surveillance et revue des services des fournisseurs",
        "Description": "Il convient que les organisations surveillent, revoient et auditent à intervalles réguliers la prestation des services assurés par les fournisseurs."
      },
      {
        "id": "15.2.2",
        "Titre": "Gestion des changements apportés dans les services des fournisseurs",
        "Description": "Il convient de gérer les changements effectués dans les prestations de service des fournisseurs, y compris le maintien et l’amélioration des politiques, procédures et mesures existant en matière de sécurité de l’information, en tenant compte du caractère critique de l’information, des systèmes et des processus concernés et de la réappréciation du risque."
      },
      {
        "id": "16.1.1",
        "Titre": "Responsabilités et procédures",
        "Description": "Il convient d’établir des responsabilités et des procédures permettant de garantir une réponse rapide, efficace et pertinente en cas d’incident lié à la sécurité de l’information."
      },
      {
        "id": "16.1.2",
        "Titre": "Signalement des événements liés à la sécurité de l’information",
        "Description": "Il convient de signaler, dans les meilleurs délais, les événements liés à la sécurité de l’information, par les voies hiérarchiques appropriées."
      },
      {
        "id": "16.1.3",
        "Titre": "Signalement des failles liées à la sécurité de l’information",
        "Description": "Il convient d’enjoindre tous les salariés et contractants utilisant les systèmes et services d’information de l’organisation à noter et à signaler toute faille de sécurité observée ou soupçonnée dans les systèmes ou services."
      },
      {
        "id": "16.1.4",
        "Titre": "Appréciation des événements liés à la sécurité de l’information et prise de décision",
        "Description": "Il convient d’apprécier les événements liés à la sécurité de l’information et de décider s’ils doivent être classés comme incidents liés à la sécurité de l’information."
      },
      {
        "id": "16.1.5",
        "Titre": "Réponse aux incidents liés à la sécurité de l’information",
        "Description": "Il convient de répondre aux incidents liés à la sécurité de l’information conformément aux procédures documentées."
      },
      {
        "id": "16.1.6",
        "Titre": "Tirer des enseignements des incidents liés à la sécurité de l’information",
        "Description": "Il convient de tirer parti des connaissances recueillies suite à l’analyse et la résolution des incidents liés à la sécurité de l’information pour réduire la probabilité ou les conséquences d’incidents ultérieurs."
      },
      {
        "id": "16.1.7",
        "Titre": "Recueil de preuves",
        "Description": "Il convient que l’organisation définisse et applique des procédures d’identification, de recueil, d’acquisition et de protection de l’information pouvant servir de preuve."
      },
      {
        "id": "17.1.1",
        "Titre": "Organisation de la continuité de la sécurité de l’information",
        "Description": "Il convient que l’organisation détermine ses exigences en matière de sécurité de l’information et de continuité du management de la sécurité de l’information dans des situations défavorables, comme lors d’une crise ou d’un sinistre."
      },
      {
        "id": "17.1.2",
        "Titre": "Mise en oeuvre de la continuité de la sécurité de l’information",
        "Description": "Il convient que l’organisation établisse, documente, mette en oeuvre et maintienne à jour des processus, des procédures et des mesures permettant de garantir le niveau requis de continuité de la sécurité de l’information au cours d’une situation défavorable."
      },
      {
        "id": "17.1.3",
        "Titre": "Vérifier, revoir et évaluer la continuité de la sécurité de l’information",
        "Description": "Il convient que l’organisation vérifie à intervalles réguliers les mesures de continuité de la sécurité de l’information déterminées et mises en oeuvre, afin que s’assurer qu’elles restent valables et efficaces dans des situations défavorables."
      },
      {
        "id": "17.2.1",
        "Titre": "Disponibilité des moyens de traitement de l’information",
        "Description": "Il convient de mettre en oeuvre des moyens de traitement de l’information avec suffisamment de redondances pour répondre aux exigences de disponibilité."
      },
      {
        "id": "18.1.1",
        "Titre": "Identification de la législation et des exigences contractuelles applicables",
        "Description": "Il convient, pour chaque système d’information et pour l’organisation elle-même, de définir, documenter et mettre à jour explicitement toutes les exigences légales, réglementaires et contractuelles en vigueur, ainsi que l’approche adoptée par l’organisation pour satisfaire à ces exigences."
      },
      {
        "id": "18.1.2",
        "Titre": "Droits de propriété intellectuelle",
        "Description": "Il convient de mettre en oeuvre des procédures appropriées visant à garantir la conformité avec les exigences légales, réglementaires et contractuelles relatives aux droits de propriété intellectuelle et à l’utilisation de logiciels propriétaires."
      },
      {
        "id": "18.1.3",
        "Titre": "Protection des enregistrements",
        "Description": "Il convient de protéger les enregistrements de la perte, de la destruction, de la falsification, des accès non autorisés et des diffusions non autorisées conformément aux exigences légales, réglementaires, contractuelles et aux exigences métier."
      },
      {
        "id": "18.1.4",
        "Titre": "Protection de la vie privée et protection des données à caractère personnel",
        "Description": "Il convient de garantir la protection de la vie privée et la protection des données à caractère personnel telles que l’exigent la législation et les réglementations applicables, le cas échéant."
      },
      {
        "id": "18.1.5",
        "Titre": "Réglementation relative aux mesures cryptographiques",
        "Description": "Il convient de prendre des mesures cryptographiques conformément aux accords, lois et réglementations applicables."
      },
      {
        "id": "18.2.1",
        "Titre": "Revue indépendante de la sécurité de l’information",
        "Description": "Il convient de procéder à des revues régulières et indépendantes de l’approche retenue par l’organisation pour gérer et mettre en oeuvre la sécurité de l’information (à savoir le suivi des objectifs, les mesures, les politiques, les procédures et les processus relatifs à la sécurité de l’information) à intervalles définis ou lorsque des changements importants sont intervenus."
      },
      {
        "id": "18.2.2",
        "Titre": "Conformité avec les politiques et les normes de sécurité",
        "Description": "Il convient que les responsables revoient régulièrement la conformité du traitement de l’information et des procédures dont ils sont chargés au regard des politiques, des normes de sécurité applicables et autres exigences de sécurité."
      },
      {
        "id": "18.2.3",
        "Titre": "Examen de la conformité technique",
        "Description": "Il convient que les systèmes d’information soient régulièrement revus pour vérifier leur conformité avec les politiques et les normes de sécurité de l’information de l’organisation."
      }
    ]
  }
}